Revit 2024 API
BuiltInFailures.CurveFailures.CantKeepJoinTangent Property
 Can't keep curve join tangent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CantKeepJoinTangent { get; }
Visual Basic
Public Shared ReadOnly Property CantKeepJoinTangent As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CantKeepJoinTangent {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace